# brew files
cask_args appdir: '/Applications'

# taps, expanding functionality
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'

# utils
brew 'autojump'
brew 'coreutils'
brew 'mas'
brew 'wifi-password'
cask 'a-better-finder-rename'
cask 'adapter'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'duet'
cask 'flux'
cask 'hazel'
cask 'hyperswitch'
cask 'keepingyouawake'
cask 'keka'
mas 'PiPifier', id: 1160374471

# scripts
tap 'vitorgalvao/tiny-scripts'
brew 'vitorgalvao/tiny-scripts/cask-repair'

# apps!
cask '1password'
cask 'airtable'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'keybase'
cask 'musicbrainz-picard'
cask 'numi'
cask 'rocket'
cask 'spectacle'
cask 'typora'
mas '2Do', id: 477670270
mas 'Airmail 3', id: 918858936
mas 'Parcel', id: 639968404
mas 'Pocket', id: 568494494
mas 'Tweetbot', id: 557168941

# programming
# brew 'redis'
# mas 'Xcode', id: 497799835
brew 'git'
brew 'hub'
brew 'jq'
brew 'mongodb'
brew 'openssl'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
cask 'iterm2'
cask 'ngrok'
cask 'postman'
cask 'visual-studio-code'

# programming languages
# brew 'go'
# brew 'python3'

# work
cask 'docker'
cask 'slack'
cask 'virtualbox'
cask 'viscosity'

# media
brew 'libav' # for pulling audio out of videos
brew 'tvnamer'
brew 'youtube-dl'
cask 'simple-comic'
cask 'spotify'
cask 'transmission'
cask 'vlc'

# fonts
tap 'caskroom/fonts'
cask 'font-inconsolata'

# gaming
cask 'battle-net'
cask 'openemu'
cask 'steam'

