# brew files
cask_args appdir: "/Applications"

# taps, expanding functionality
# tap "heroku/brew"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "vitorgalvao/tiny-scripts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# brews
brew "ack"
brew "autojump"
brew "coreutils"
brew "git"
brew "hub"
brew "jq"
brew "libav" # for pulling audio out of videos
brew "mas"
# brew 'mongodb'
brew "openssl"
# brew 'redis'
# brew 'shellcheck'
# brew "tvnamer"
brew "wifi-password"
brew "youtube-dl"
# brew "zsh" # comes default now?
# brew "zsh-completions"
# brew "zsh-syntax-highlighting"
cask "font-hack-nerd-font"
brew "lsd"
cask "obsidian"
cask "zoom"
cask "daisydisk"
cask "itsycal"
cask "zappy"
brew "direnv"
brew "vitorgalvao/tiny-scripts/cask-repair"

# programming languages
# brew 'go'
# brew 'node' # installed with nodenv
# brew "python3"
brew "pyenv"
brew "nodenv"

# casks
cask "1password"
# cask "a-better-finder-rename"
# cask "adapter"
cask "alfred"
cask "alt-tab"
cask "airtable"
cask "bartender"
cask "calibre"
cask "adobe-digital-editions"
cask "dash"
cask "dropbox"
# cask 'fluid'
# cask "flux"
cask "font-inconsolata"
cask "google-chrome"
# cask 'google-drive'
cask "hazel"
cask "keepingyouawake"
cask "keka"
# cask 'keybase'
# cask 'musicbrainz-picard'
cask "numi"
cask "rocket"
cask "spectacle"
cask "scroll-reverser"
# cask 'typora'
# cask 'catch'
# cask "transmission"
# cask "smcfancontrol"
cask "runjs"
# cask "mullvadvpn"
# cask "plex-media-server"
cask "screens"
# cask 'screens-connect'
cask "zsa-wally"
cask "firefox"

# work
# cask "docker"
cask "slack"
# cask "virtualbox"
cask "viscosity"
# cask "tripmode"
cask "sensei"

# programming
cask "iterm2"
cask "ngrok"
# cask 'postman'
# cask 'sublime-text3'
cask "visual-studio-code"
# brew 'heroku/brew/heroku'
# brew "neovim"f

# media
# cask 'spotify'
# cask 'techstoreclub-simple-comic'
# cask "iina"

# gaming
# cask "battle-net"
cask "discord"
# cask "openemu"
cask "steam"
# cask "league-of-legends"
# cask "epic-games"

mas "AdGuard for Safari", id: 1440147259
mas "Parcel", id: 639968404
# mas 'PiPifier', id: 1160374471
mas "Pocket", id: 568494494
# mas "Tweetbot", id: 557168941
mas "Drafts", id: 1435957248
mas "Trello", id: 1278508951
mas "Finances", id: 1218241304
mas "Things", id: 904280696
# mas 'Xcode', id: 497799835
mas "Dato", id: 1470584107
mas "Speedtest", id: 1153157709
